MaJerle/stm32f429/00-STM32_SVD/STM32F105xx.svd
        <register>          <name>IPR11</name>          <displayName>IPR11</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x42C</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>        <register>          <name>IPR12</name>          <displayName>IPR12</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x430</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>        <register>          <name>IPR13</name>          <displayName>IPR13</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x434</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>        <register>          <name>IPR14</name>          <displayName>IPR14</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x438</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>        <register>          <name>IPR15</name>          <displayName>IPR15</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x43C</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>        <register>          <name>IPR16</name>          <displayName>IPR16</displayName>          <description>Interrupt Priority Register</description>          <addressOffset>0x440</addressOffset>          <size>0x20</size>          <access>read-write</access>          <resetValue>0x00000000</resetValue>          <fields>            <field>              <name>IPR_N0</name>              <description>IPR_N0</description>              <bitOffset>0</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N1</name>              <description>IPR_N1</description>              <bitOffset>8</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N2</name>              <description>IPR_N2</description>              <bitOffset>16</bitOffset>              <bitWidth>8</bitWidth>            </field>            <field>              <name>IPR_N3</name>              <description>IPR_N3</description>              <bitOffset>24</bitOffset>              <bitWidth>8</bitWidth>            </field>          </fields>        </register>       </registers>    </peripheral>  </peripherals>
</device>
